/*
*********************************************************************************************************
*                                                uC/OS-II
*                                          The Real-Time Kernel
*
*                        (c) Copyright 1992-1998, Jean J. Labrosse, Plantation, FL
*                                           All Rights Reserved
*
*                                           MASTER INCLUDE FILE
*********************************************************************************************************
*/

/*
*********************************************************************************************************
* 
author:1949KJY
time:20191608
qq:2692377302
https://item.taobao.com/item.htm?spm=a1z10.1-c.w4004-18323443223.14.456657b1N7KwE0&id=580551386625
*                                     
*********************************************************************************************************
*/

#ifndef __INCLUDES__
#define __INCLUDES__

#include    "HC89F0541.h"
#include    "uCosii\os_cpu.h"
#include    "uCosii\os_cfg.h"
#include    "uCosii\ucos_ii.h"




#define buzzer P3_2		//·äÃùÆ÷		1Ïì0Ãð
#define G_led	 P3_0		//ÂÌLED			0ÁÁ1Ãð
#define R_led	 P3_1		//ºìLED			0ÁÁ1Ãð
#define fan	   P1_5 	//·ç»ú
#define Brush  P3_3		//±ßË¢
#define Wifi	P0_7 		//wifiÊ¹ÄÜ
#define	floor	P2_1		//µØ¼ìÊ¹ÄÜ
#define mapan P0_6		//ÂëÅÌ
sbit L1_touch = P1^3; //×ó´¥Ãþ		1°´ÏÂ0Ì§Æð
sbit R1_touch = P1^4; //ÓÒ´¥Ãþ		1°´ÏÂ0Ì§Æð
sbit crash = P1^0;		//Åö×²			1Åö×²


sbit power = P3^4;//³äµç²åÈë¼ì²â	0³äµç 1Î´³äµç
sbit power_enabled =P2^0; //³äµç¼ì²â 1Îª³äÂú


#endif
/*
*********************************************************************************************************
* 
author:1949KJY
time:20191608
qq:2692377302
https://item.taobao.com/item.htm?spm=a1z10.1-c.w4004-18323443223.14.456657b1N7KwE0&id=580551386625
*                                     
*********************************************************************************************************
*/